import RegisterLayout from './RegisterLayout';
import TermSection from './TermSection';
import { useState } from 'react';

const RegisterTerm = () => {
  const [agree1, setAgree1] = useState(false);
  const [agree2, setAgree2] = useState(false);
  const setAgree1True = () => {
    setAgree1(true);
  };
  const setAgree1False = () => {
    setAgree1(false);
  };
  const setAgree2True = () => {
    setAgree2(true);
  };
  const setAgree2False = () => {
    setAgree2(false);
  };

  return (
    <RegisterLayout
      title={'약관 동의하기'}
      description={
        '아래 약관을 동의해야 Match.GG 서비스를 이용하실 수 있습니다.'
      }
      prevLink={'/'}
      nextLink={'/register/games'}
      phase={1}
    >
      <TermSection
        title={'MATCH.GG 이용 약관'}
        contents={
          '이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1이용약관1'
        }
        agree={agree1}
        setAgreeTrue={setAgree1True}
        setAgreeFalse={setAgree1False}
      />
      <TermSection
        title={'개인정보 수집 동의 약관'}
        contents={
          '이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2이용약관2'
        }
        agree={agree2}
        setAgreeTrue={setAgree2True}
        setAgreeFalse={setAgree2False}
      />
    </RegisterLayout>
  );
};

export default RegisterTerm;
